NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_prov_provisioning.c
#define TEST_ATTENTION_DURATION_S 60

typedef union
{
     prov_pdu_invite_t pdu_invite;
     prov_pdu_caps_t pdu_caps;
     prov_pdu_prov_start_t pdu_start;
} prov_pdu_t;

static uint32_t tx_dummy(prov_bearer_t * p_bearer, const uint8_t * p_data, uint16_t length);
static uint32_t listen_start_dummy(prov_bearer_t * p_bearer, const char * p_uri, uint16_t oob_info, uint32_t link_timeout_us);
static uint32_t listen_stop_dummy(prov_bearer_t * p_bearer);
static uint32_t link_open_dummy(prov_bearer_t * p_bearer, const uint8_t * p_uuid, uint32_t link_timeout_us);
static void link_close_dummy(prov_bearer_t * p_bearer, nrf_mesh_prov_link_close_reason_t close_reason);

static nrf_mesh_prov_ctx_t m_provisioner_ctx;
static nrf_mesh_prov_ctx_t m_provisionee_ctx;
static prov_pdu_t m_prov_pdu;
static const char * m_URI = "hello";
static uint16_t m_oob_info_sources = 0;

static prov_bearer_interface_t m_interface =
{
    .tx = tx_dummy,
    .listen_start = listen_start_dummy,
    .listen_stop = listen_stop_dummy,
    .link_open = link_open_dummy,
    .link_close = link_close_dummy
};

static prov_bearer_t m_bearer_provisionee;
static prov_bearer_t m_bearer_provisioner;
static bool provisioner_oob_key_req_happened;
static bool provisionee_oob_key_req_happened;
static bool provisionee_invite_rx_happened;
static bool provisionee_start_rx_happened;

static uint32_t tx_dummy(prov_bearer_t * p_bearer, const uint8_t * p_data, uint16_t length)
{
    (void)p_bearer;
    (void)p_data;
    (void)length;
    return NRF_SUCCESS;
}

static uint32_t listen_start_dummy(prov_bearer_t * p_bearer, const char * p_uri, uint16_t oob_info, uint32_t link_timeout_us)
{
    (void)p_bearer;
    (void)p_uri;
    (void)oob_info;
    (void)link_timeout_us;
    return NRF_SUCCESS;
}

static uint32_t listen_stop_dummy(prov_bearer_t * p_bearer)
{
    (void)p_bearer;
    return NRF_SUCCESS;
}

static uint32_t link_open_dummy(prov_bearer_t * p_bearer, const uint8_t * p_uuid, uint32_t link_timeout_us)
{
    (void)p_bearer;
    (void)p_uuid;
    (void)link_timeout_us;
    return NRF_SUCCESS;
}

static void link_close_dummy(prov_bearer_t * p_bearer, nrf_mesh_prov_link_close_reason_t close_reason)
{
    (void)p_bearer;
    (void)close_reason;
}

uint32_t tx_caps_cb(prov_bearer_t* p_bearer, const prov_pdu_caps_t* p_caps, uint8_t* p_confirmation_inputs, int num_calls)
{
    (void)num_calls;
    (void)p_confirmation_inputs;

    TEST_ASSERT_TRUE(p_bearer == &m_bearer_provisionee);
    TEST_ASSERT_NOT_NULL(p_caps);
    TEST_ASSERT_EQUAL_UINT8(PROV_PDU_TYPE_CAPABILITIES, p_caps->pdu_type);
    TEST_ASSERT_EQUAL_UINT8(m_provisionee_ctx.capabilities.num_elements, p_caps->num_elements);
    TEST_ASSERT_EQUAL_UINT16(m_provisionee_ctx.capabilities.algorithms, BE2LE16(p_caps->algorithms));
    TEST_ASSERT_EQUAL_UINT8(m_provisionee_ctx.capabilities.pubkey_type, p_caps->pubkey_type);
    TEST_ASSERT_EQUAL_UINT8(m_provisionee_ctx.capabilities.oob_static_types, p_caps->oob_static_types);
    TEST_ASSERT_EQUAL_UINT8(m_provisionee_ctx.capabilities.oob_input_size, p_caps->oob_input_size);
    TEST_ASSERT_EQUAL_UINT8(m_provisionee_ctx.capabilities.oob_output_size, p_caps->oob_output_size);
    TEST_ASSERT_EQUAL_UINT16(m_provisionee_ctx.capabilities.oob_input_actions, BE2LE16(p_caps->oob_input_actions));
    TEST_ASSERT_EQUAL_UINT16(m_provisionee_ctx.capabilities.oob_output_actions, BE2LE16(p_caps->oob_output_actions));

    memcpy(&m_prov_pdu.pdu_caps, p_caps, sizeof(prov_pdu_caps_t));

    return NRF_SUCCESS;
}

uint32_t tx_start_cb(prov_bearer_t* p_bearer, const prov_pdu_prov_start_t* p_start, uint8_t* p_confirmation_inputs, int num_calls)
{
    (void)num_calls;
    (void)p_confirmation_inputs;

    TEST_ASSERT_TRUE(p_bearer == &m_bearer_provisioner);
    TEST_ASSERT_NOT_NULL(p_start);
    TEST_ASSERT_EQUAL_UINT8(PROV_PDU_TYPE_START, p_start->pdu_type);
    TEST_ASSERT_EQUAL_UINT8(PROV_PDU_START_ALGO_FIPS_P256, p_start->algorithm);
    TEST_ASSERT_EQUAL_UINT8(1, p_start->public_key);
    TEST_ASSERT_EQUAL_UINT8(NRF_MESH_PROV_OOB_METHOD_OUTPUT, p_start->auth_method);
    TEST_ASSERT_EQUAL_UINT8(NRF_MESH_PROV_OUTPUT_ACTION_DISPLAY_NUMERIC, p_start->auth_action);
    TEST_ASSERT_EQUAL_UINT8(6, p_start->auth_size);

    memcpy(&m_prov_pdu.pdu_start, p_start, sizeof(prov_pdu_prov_start_t));

    return NRF_SUCCESS;
}

static void provisionee_event_handler(const nrf_mesh_prov_evt_t * p_evt)
{
    TEST_ASSERT_NOT_NULL(p_evt);

    switch (p_evt->type)
    {
        case NRF_MESH_PROV_EVT_INVITE_RECEIVED:
            {
                const nrf_mesh_prov_evt_invite_received_t * p_invite = &p_evt->params.invite_received;

                TEST_ASSERT_TRUE(&m_provisionee_ctx == p_invite->p_context);
                TEST_ASSERT_EQUAL_UINT8(TEST_ATTENTION_DURATION_S, p_invite->attention_duration_s);

                provisionee_invite_rx_happened = true;
            }
            break;
        case NRF_MESH_PROV_EVT_START_RECEIVED:
            {
                const nrf_mesh_prov_evt_start_received_t * p_start = &p_evt->params.start_received;

                TEST_ASSERT_TRUE(&m_provisionee_ctx == p_start->p_context);

                provisionee_start_rx_happened = true;
            }
            break;
        case NRF_MESH_PROV_EVT_OOB_PUBKEY_REQUEST:
            {
                const nrf_mesh_prov_evt_oob_pubkey_request_t * p_data = &p_evt->params.oob_pubkey_request;

                TEST_ASSERT_TRUE(&m_provisionee_ctx == p_data->p_context);

                provisionee_oob_key_req_happened = true;
            }
            break;
        default:
            break;
    }
}

static void provisioner_event_handler(const nrf_mesh_prov_evt_t * p_evt)
{
    TEST_ASSERT_NOT_NULL(p_evt);

    switch (p_evt->type)
    {
        case NRF_MESH_PROV_EVT_CAPS_RECEIVED:
            {
                const nrf_mesh_prov_evt_caps_received_t * p_data = &p_evt->params.oob_caps_received;
                const nrf_mesh_prov_oob_caps_t * p_caps = &p_data->oob_caps;

                TEST_ASSERT_TRUE(&m_provisioner_ctx == p_data->p_context);
                TEST_ASSERT_EQUAL_UINT8(m_provisionee_ctx.capabilities.num_elements, p_caps->num_elements);
                TEST_ASSERT_EQUAL_UINT16(m_provisionee_ctx.capabilities.algorithms, p_caps->algorithms);
                TEST_ASSERT_EQUAL_UINT8(m_provisionee_ctx.capabilities.pubkey_type, p_caps->pubkey_type);
                TEST_ASSERT_EQUAL_UINT8(m_provisionee_ctx.capabilities.oob_static_types, p_caps->oob_static_types);
                TEST_ASSERT_EQUAL_UINT8(m_provisionee_ctx.capabilities.oob_input_size, p_caps->oob_input_size);
                TEST_ASSERT_EQUAL_UINT8(m_provisionee_ctx.capabilities.oob_output_size, p_caps->oob_output_size);
                TEST_ASSERT_EQUAL_UINT16(m_provisionee_ctx.capabilities.oob_input_actions, p_caps->oob_input_actions);
                TEST_ASSERT_EQUAL_UINT16(m_provisionee_ctx.capabilities.oob_output_actions, p_caps->oob_output_actions);
            }
            break;
        case NRF_MESH_PROV_EVT_OOB_PUBKEY_REQUEST:
            {
                const nrf_mesh_prov_evt_oob_pubkey_request_t * p_data = &p_evt->params.oob_pubkey_request;

