NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_prov_provisioning.c
                TEST_ASSERT_TRUE(&m_provisioner_ctx == p_data->p_context);

                provisioner_oob_key_req_happened = true;
            }
            break;
        default:
            break;
    }
}

/********** Test Initialization and Finalization ***********/

void setUp(void)
{
    provisioning_mock_Init();
    enc_mock_Init();
    nrf_mesh_utils_mock_Init();
    uECC_mock_Init();
    rand_mock_Init();
    mesh_config_entry_mock_Init();
}

void tearDown(void)
{
    provisioning_mock_Verify();
    provisioning_mock_Destroy();
    enc_mock_Verify();
    enc_mock_Destroy();
    nrf_mesh_utils_mock_Verify();
    nrf_mesh_utils_mock_Destroy();
    uECC_mock_Verify();
    uECC_mock_Destroy();
    rand_mock_Verify();
    rand_mock_Destroy();
    mesh_config_entry_mock_Verify();
    mesh_config_entry_mock_Destroy();
}

/********** Test Cases **********/

void test_provisioning(void)
{
    TEST_IGNORE_MESSAGE("UNIMPLEMENTED TEST");
}

void test_oob_authentication(void)
{
    m_oob_info_sources = NRF_MESH_PROV_OOB_INFO_SOURCE_NUMBER | NRF_MESH_PROV_OOB_INFO_SOURCE_INSIDE_MANUAL;
    uint8_t uuid[NRF_MESH_UUID_SIZE];
    nrf_mesh_prov_provisioning_data_t prov_data_stub;

    memset(&m_bearer_provisionee, 0, sizeof(prov_bearer_t));
    m_bearer_provisionee.bearer_type = NRF_MESH_PROV_BEARER_MESH;
    m_bearer_provisionee.p_interface = &m_interface;

    memset(&m_provisionee_ctx, 0, sizeof(nrf_mesh_prov_ctx_t));
    m_provisionee_ctx.p_active_bearer = &m_bearer_provisionee;
    m_provisionee_ctx.event_handler = provisionee_event_handler;
    m_provisionee_ctx.role = NRF_MESH_PROV_ROLE_PROVISIONEE;
    m_bearer_provisionee.p_parent = &m_provisionee_ctx;

    /* 1 Test provisionee invitation */
    /* 1.1 Initialization */
    TEST_ASSERT_EQUAL_UINT32(NRF_SUCCESS, prov_provisionee_listen(&m_provisionee_ctx,
                                                                  &m_bearer_provisionee,
                                                                  m_URI,
                                                                  m_oob_info_sources));
    /* 1.2 Start listening */
    m_bearer_provisionee.p_callbacks->opened(&m_bearer_provisionee);

    /* 1.3 Receiving invitation from provisioner. Sending back capabilities. */
    prov_tx_capabilities_StubWithCallback(tx_caps_cb);
    prov_packet_length_valid_IgnoreAndReturn(true);
    m_prov_pdu.pdu_invite.pdu_type =PROV_PDU_TYPE_INVITE;
    m_prov_pdu.pdu_invite.attention_duration_s = TEST_ATTENTION_DURATION_S;
    m_provisionee_ctx.capabilities.algorithms = NRF_MESH_PROV_ALGORITHM_FIPS_P256EC;
    m_provisionee_ctx.capabilities.num_elements = 1;
    m_provisionee_ctx.capabilities.pubkey_type = NRF_MESH_PROV_OOB_PUBKEY_TYPE_OOB;
    m_provisionee_ctx.capabilities.oob_static_types = NRF_MESH_PROV_OOB_STATIC_TYPE_SUPPORTED;
    m_provisionee_ctx.capabilities.oob_input_size = 1;
    m_provisionee_ctx.capabilities.oob_input_actions = NRF_MESH_PROV_OOB_INPUT_ACTION_ENTER_NUMBER;
    m_provisionee_ctx.capabilities.oob_output_size = 1;
    m_provisionee_ctx.capabilities.oob_input_actions = NRF_MESH_PROV_OOB_OUTPUT_ACTION_NUMERIC;
    m_bearer_provisionee.p_callbacks->rx(&m_bearer_provisionee, (const uint8_t *)&m_prov_pdu.pdu_invite, sizeof(prov_pdu_invite_t));

    TEST_ASSERT_TRUE(provisionee_invite_rx_happened);

    memset(&m_bearer_provisioner, 0, sizeof(prov_bearer_t));
    m_bearer_provisioner.bearer_type = NRF_MESH_PROV_BEARER_MESH;
    m_bearer_provisioner.p_interface = &m_interface;

    memset(&m_provisioner_ctx, 0, sizeof(nrf_mesh_prov_ctx_t));
    m_provisioner_ctx.p_active_bearer = &m_bearer_provisioner;
    m_provisioner_ctx.event_handler = provisioner_event_handler;
    m_bearer_provisioner.p_parent = &m_provisioner_ctx;
    m_provisioner_ctx.role = NRF_MESH_PROV_ROLE_PROVISIONER;

    /* 2 Test provisioner invitation */
    /* 2.1 Initialization */
    TEST_ASSERT_EQUAL_UINT32(NRF_SUCCESS, prov_provisioner_provision(&m_provisioner_ctx,
                                                                     uuid,
                                                                     0,
                                                                     &prov_data_stub));
    /* 2.2 Start listening */
    prov_tx_invite_IgnoreAndReturn(NRF_SUCCESS);
    m_bearer_provisioner.p_callbacks->opened(&m_bearer_provisioner);

    /* 2.3 Receiving invitation from provisioner. Sending back capabilities. */
    m_prov_pdu.pdu_caps.pdu_type = PROV_PDU_TYPE_CAPABILITIES;
    prov_packet_length_valid_IgnoreAndReturn(true);
    m_bearer_provisioner.p_callbacks->rx(&m_bearer_provisioner, (const uint8_t *)&m_prov_pdu.pdu_caps, sizeof(prov_pdu_caps_t));

    m_provisioner_ctx.capabilities.algorithms = NRF_MESH_PROV_ALGORITHM_FIPS_P256EC;
    m_provisioner_ctx.capabilities.num_elements = 1;
    m_provisioner_ctx.capabilities.pubkey_type = NRF_MESH_PROV_OOB_PUBKEY_TYPE_OOB;
    m_provisioner_ctx.capabilities.oob_static_types = NRF_MESH_PROV_OOB_STATIC_TYPE_SUPPORTED;
    m_provisioner_ctx.capabilities.oob_input_size = 6;
    m_provisioner_ctx.capabilities.oob_input_actions = NRF_MESH_PROV_OOB_INPUT_ACTION_ENTER_NUMBER;
    m_provisioner_ctx.capabilities.oob_output_size = 6;
    m_provisioner_ctx.capabilities.oob_output_actions = NRF_MESH_PROV_OOB_OUTPUT_ACTION_NUMERIC;

    /* 3. Test provisioner tx OOB usage */
    prov_tx_start_StubWithCallback(tx_start_cb);
    TEST_ASSERT_EQUAL_UINT32(NRF_SUCCESS, prov_provisioner_oob_use(&m_provisioner_ctx,
                                                                   NRF_MESH_PROV_OOB_METHOD_OUTPUT,
                                                                   NRF_MESH_PROV_OUTPUT_ACTION_DISPLAY_NUMERIC,
                                                                   6));

    /* 4. Test provisionee tx OOB usage with OOB public key event */
    prov_packet_length_valid_IgnoreAndReturn(true);
    m_bearer_provisionee.p_callbacks->ack(&m_bearer_provisionee);
    m_bearer_provisionee.p_callbacks->rx(&m_bearer_provisionee, (const uint8_t *)&m_prov_pdu.pdu_start, sizeof(prov_pdu_prov_start_t));

    TEST_ASSERT_TRUE(provisionee_start_rx_happened);

    /* 5. Test provisioner OOB public key event */
    m_bearer_provisioner.p_callbacks->ack(&m_bearer_provisioner);

    TEST_ASSERT_TRUE(provisionee_oob_key_req_happened);
    TEST_ASSERT_TRUE(provisioner_oob_key_req_happened);
}

void test_disallow_public_key_oob_when_not_supported(void)
{
#if !NRF_MESH_PROV_FORCE_SECURE_PROVISIONING
    m_oob_info_sources = 0;
    memset(&m_bearer_provisionee, 0, sizeof(prov_bearer_t));
    m_bearer_provisionee.bearer_type = NRF_MESH_PROV_BEARER_MESH;
    m_bearer_provisionee.p_interface = &m_interface;

    memset(&m_provisionee_ctx, 0, sizeof(nrf_mesh_prov_ctx_t));
    m_provisionee_ctx.p_active_bearer = &m_bearer_provisionee;
    m_provisionee_ctx.event_handler = provisionee_event_handler;
    m_bearer_provisionee.p_parent = &m_provisionee_ctx;
    m_provisionee_ctx.role = NRF_MESH_PROV_ROLE_PROVISIONEE;

    /* 1 Test provisionee invitation */
    /* 1.1 Initialization */
    TEST_ASSERT_EQUAL_UINT32(NRF_SUCCESS, prov_provisionee_listen(&m_provisionee_ctx,
                                                                  &m_bearer_provisionee,
                                                                  m_URI,
                                                                  m_oob_info_sources));
    /* 1.2 Start listening */
    m_bearer_provisionee.p_callbacks->opened(&m_bearer_provisionee);

