NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_prov_provisioning.c
    /* 1.3 Receiving invitation from provisioner. Sending back capabilities. */
    prov_tx_capabilities_StubWithCallback(tx_caps_cb);
    prov_packet_length_valid_IgnoreAndReturn(true);
    m_prov_pdu.pdu_invite.pdu_type = PROV_PDU_TYPE_INVITE;
    m_prov_pdu.pdu_invite.attention_duration_s = TEST_ATTENTION_DURATION_S;

    m_provisionee_ctx.capabilities.algorithms = NRF_MESH_PROV_ALGORITHM_FIPS_P256EC;
    m_provisionee_ctx.capabilities.num_elements = 1;
    m_provisionee_ctx.capabilities.pubkey_type = NRF_MESH_PROV_OOB_PUBKEY_TYPE_INBAND;
    m_provisionee_ctx.capabilities.oob_static_types = NRF_MESH_PROV_OOB_STATIC_TYPE_SUPPORTED;
    m_provisionee_ctx.capabilities.oob_input_size = 6;
    m_provisionee_ctx.capabilities.oob_input_actions = NRF_MESH_PROV_OOB_INPUT_ACTION_ENTER_NUMBER;
    m_provisionee_ctx.capabilities.oob_output_size = 6;
    m_provisionee_ctx.capabilities.oob_output_actions = NRF_MESH_PROV_OOB_OUTPUT_ACTION_NUMERIC;

    m_bearer_provisionee.p_callbacks->rx(&m_bearer_provisionee, (const uint8_t *)&m_prov_pdu.pdu_invite, sizeof(prov_pdu_invite_t));

    TEST_ASSERT_TRUE(provisionee_invite_rx_happened);

    m_bearer_provisionee.p_callbacks->ack(&m_bearer_provisionee);
}
#endif

void test_unsecure_provisioning_not_allowed_inband_pubkey_no_oob(void)
{
#if NRF_MESH_PROV_FORCE_SECURE_PROVISIONING
    helper_secure_provisioning_tests_common();

    /* Test: Choose No OOB Public key, and no static OOB. */
    memset(&m_prov_pdu, 0, sizeof(m_prov_pdu));
    m_prov_pdu.pdu_start.pdu_type = PROV_PDU_TYPE_START;
    m_prov_pdu.pdu_start.algorithm = NRF_MESH_PROV_ALGORITHM_FIPS_P256;

    m_prov_pdu.pdu_start.public_key = NRF_MESH_PROV_OOB_PUBKEY_TYPE_INBAND;
    m_prov_pdu.pdu_start.auth_method = NRF_MESH_PROV_OOB_METHOD_NONE;

    prov_tx_failed_ExpectAndReturn(&m_bearer_provisionee, NRF_MESH_PROV_FAILURE_CODE_INVALID_FORMAT, NRF_SUCCESS);
    m_bearer_provisionee.p_callbacks->rx(&m_bearer_provisionee, (const uint8_t *) &m_prov_pdu.pdu_start, sizeof(prov_pdu_prov_start_t));
#else
    TEST_IGNORE_MESSAGE("Ignored because `NRF_MESH_PROV_FORCE_SECURE_PROVISIONING` is not set");
#endif
}

void test_unsecure_provisioning_not_allowed_inband_pubkey_static_oob(void)
{
#if NRF_MESH_PROV_FORCE_SECURE_PROVISIONING
    helper_secure_provisioning_tests_common();

    /* Test: Choose Inband Public key, and static OOB. */
    memset(&m_prov_pdu, 0, sizeof(m_prov_pdu));
    m_prov_pdu.pdu_start.pdu_type = PROV_PDU_TYPE_START;
    m_prov_pdu.pdu_start.algorithm = NRF_MESH_PROV_ALGORITHM_FIPS_P256;

    m_prov_pdu.pdu_start.public_key = NRF_MESH_PROV_OOB_PUBKEY_TYPE_INBAND;
    m_prov_pdu.pdu_start.auth_method = NRF_MESH_PROV_OOB_METHOD_STATIC;

    prov_tx_failed_ExpectAndReturn(&m_bearer_provisionee, NRF_MESH_PROV_FAILURE_CODE_INVALID_FORMAT, NRF_SUCCESS);
    m_bearer_provisionee.p_callbacks->rx(&m_bearer_provisionee, (const uint8_t *) &m_prov_pdu.pdu_start, sizeof(prov_pdu_prov_start_t));
#else
    TEST_IGNORE_MESSAGE("Ignored because `NRF_MESH_PROV_FORCE_SECURE_PROVISIONING` is not set");
#endif
}

void test_unsecure_provisioning_not_allowed_inband_pubkey_output_oob_sz_5(void)
{
#if NRF_MESH_PROV_FORCE_SECURE_PROVISIONING
    helper_secure_provisioning_tests_common();

    /* Test: Choose Inband Public key, and Output OOB Alphanumeric with size 5. */
    memset(&m_prov_pdu, 0, sizeof(m_prov_pdu));
    m_prov_pdu.pdu_start.pdu_type = PROV_PDU_TYPE_START;
    m_prov_pdu.pdu_start.algorithm = NRF_MESH_PROV_ALGORITHM_FIPS_P256;

    m_prov_pdu.pdu_start.public_key = NRF_MESH_PROV_OOB_PUBKEY_TYPE_INBAND;
    m_prov_pdu.pdu_start.auth_method = NRF_MESH_PROV_OOB_METHOD_OUTPUT;
    m_prov_pdu.pdu_start.auth_action = NRF_MESH_PROV_OUTPUT_ACTION_ALPHANUMERIC;
    m_prov_pdu.pdu_start.auth_size = 5;

    prov_tx_failed_ExpectAndReturn(&m_bearer_provisionee, NRF_MESH_PROV_FAILURE_CODE_INVALID_FORMAT, NRF_SUCCESS);
    m_bearer_provisionee.p_callbacks->rx(&m_bearer_provisionee, (const uint8_t *) &m_prov_pdu.pdu_start, sizeof(prov_pdu_prov_start_t));
#else
    TEST_IGNORE_MESSAGE("Ignored because `NRF_MESH_PROV_FORCE_SECURE_PROVISIONING` is not set");
#endif
}

void test_unsecure_provisioning_not_allowed_inband_pubkey_output_blink_sz_6(void)
{
#if NRF_MESH_PROV_FORCE_SECURE_PROVISIONING
    helper_secure_provisioning_tests_common();

    /* Test: Choose Inband Public key, and Output OOB Blink with size 6. */
    memset(&m_prov_pdu, 0, sizeof(m_prov_pdu));
    m_prov_pdu.pdu_start.pdu_type = PROV_PDU_TYPE_START;
    m_prov_pdu.pdu_start.algorithm = NRF_MESH_PROV_ALGORITHM_FIPS_P256;

    m_prov_pdu.pdu_start.public_key = NRF_MESH_PROV_OOB_PUBKEY_TYPE_INBAND;
    m_prov_pdu.pdu_start.auth_method = NRF_MESH_PROV_OOB_METHOD_OUTPUT;
    m_prov_pdu.pdu_start.auth_action = NRF_MESH_PROV_OUTPUT_ACTION_BLINK;
    m_prov_pdu.pdu_start.auth_size = 6;

    prov_tx_failed_ExpectAndReturn(&m_bearer_provisionee, NRF_MESH_PROV_FAILURE_CODE_INVALID_FORMAT, NRF_SUCCESS);
    m_bearer_provisionee.p_callbacks->rx(&m_bearer_provisionee, (const uint8_t *) &m_prov_pdu.pdu_start, sizeof(prov_pdu_prov_start_t));
#else
    TEST_IGNORE_MESSAGE("Ignored because `NRF_MESH_PROV_FORCE_SECURE_PROVISIONING` is not set");
#endif
}

void test_unsecure_provisioning_not_allowed_inband_pubkey_input_oob_sz_5(void)
{
#if NRF_MESH_PROV_FORCE_SECURE_PROVISIONING
    helper_secure_provisioning_tests_common();

    /* Test: Choose Inband Public key, and Input OOB Number with size 5. */
    memset(&m_prov_pdu, 0, sizeof(m_prov_pdu));
    m_prov_pdu.pdu_start.pdu_type = PROV_PDU_TYPE_START;
    m_prov_pdu.pdu_start.algorithm = NRF_MESH_PROV_ALGORITHM_FIPS_P256;

    m_prov_pdu.pdu_start.public_key = NRF_MESH_PROV_OOB_PUBKEY_TYPE_INBAND;
    m_prov_pdu.pdu_start.auth_method = NRF_MESH_PROV_OOB_METHOD_INPUT;
    m_prov_pdu.pdu_start.auth_action = NRF_MESH_PROV_INPUT_ACTION_ENTER_NUMBER;
    m_prov_pdu.pdu_start.auth_size = 5;

    prov_tx_failed_ExpectAndReturn(&m_bearer_provisionee, NRF_MESH_PROV_FAILURE_CODE_INVALID_FORMAT, NRF_SUCCESS);
    m_bearer_provisionee.p_callbacks->rx(&m_bearer_provisionee, (const uint8_t *) &m_prov_pdu.pdu_start, sizeof(prov_pdu_prov_start_t));
#else
    TEST_IGNORE_MESSAGE("Ignored because `NRF_MESH_PROV_FORCE_SECURE_PROVISIONING` is not set");
#endif
}

void test_unsecure_provisioning_not_allowed_inband_pubkey_input_push_sz_6(void)
{
#if NRF_MESH_PROV_FORCE_SECURE_PROVISIONING
    helper_secure_provisioning_tests_common();

    /* Test: Choose Inband Public key, and Input OOB Push with size 6. */
    memset(&m_prov_pdu, 0, sizeof(m_prov_pdu));
    m_prov_pdu.pdu_start.pdu_type = PROV_PDU_TYPE_START;
    m_prov_pdu.pdu_start.algorithm = NRF_MESH_PROV_ALGORITHM_FIPS_P256;

    m_prov_pdu.pdu_start.public_key = NRF_MESH_PROV_OOB_PUBKEY_TYPE_INBAND;
    m_prov_pdu.pdu_start.auth_method = NRF_MESH_PROV_OOB_METHOD_INPUT;
    m_prov_pdu.pdu_start.auth_action = NRF_MESH_PROV_INPUT_ACTION_PUSH;
    m_prov_pdu.pdu_start.auth_size = 6;

    prov_tx_failed_ExpectAndReturn(&m_bearer_provisionee, NRF_MESH_PROV_FAILURE_CODE_INVALID_FORMAT, NRF_SUCCESS);
    m_bearer_provisionee.p_callbacks->rx(&m_bearer_provisionee, (const uint8_t *) &m_prov_pdu.pdu_start, sizeof(prov_pdu_prov_start_t));
#else
    TEST_IGNORE_MESSAGE("Ignored because `NRF_MESH_PROV_FORCE_SECURE_PROVISIONING` is not set");
#endif
}